import os
from docx import Document
from docx.shared import Pt, Inches

task__1_2 = [
    #1)	
    "Що таке проектування?",
    #2)	
    "Що таке інженерне проектування?",
    #3)	
    "Що таке автоматизація проектування?",
    #4)	
    "Що таке CAD?",
    #5)	
    "Що таке CAE?",
    #6)	
    "Що таке PDM?",
    #7)	
    "Що таке CALS?",
    #8)	
    "Яка діяльність виконується на етапі проектування?",
    #9)	
    "Яка діяльність виконується на етапі підготовки виробництва?",
    #10)	
    "Яка діяльність виконується на етапі виробництва?",
    #11)	
    "Яка діяльність виконується на пост-виробничих етапах?",
    #12)	
    "Що таке технічна система та які її елементи?",
    #13)	
    "Що таке деталь (як елемент технічної системи)?",
    #14)	
    "Що таке ланка (як елемент технічної системи)?",
    #15)	
    "Що таке група (як елемент технічної системи)?",
    #16)	
    "Що таке вузол (як елемент технічної системи)?",
    #17)	
    "Що таке розташування (як відношення між елементами технічної системи)?",
    #18)	
    "Що таке зв’язки (як відношення між елементами технічної системи)?",
    #19)	
    "Що таке система (у рамках теорії систем та системотехніки)?",
    #20)	
    "Що таке елемент (у рамках теорії систем та системотехніки)?",
    #21)	
    "Що таке складна система (у рамках теорії систем та системотехніки)?",
    #22)	
    "Що таке підсистема (у рамках теорії систем та системотехніки)?",
    #23)	
    "Що таке надсистема (у рамках теорії систем та системотехніки)?",
    #24)	
    "Що таке структура (у рамках теорії систем та системотехніки)?",
    #25)	
    "Що таке параметр (у рамках теорії систем та системотехніки)?",
    #26)	
    "Що таке фазова змінна (у рамках теорії систем та системотехніки)?",
    #27)	
    "Що таке стан (у рамках теорії систем та системотехніки)?",
    #28)	
    "Що таке поводження(динаміка) системи (у рамках теорії систем та системотехніки)?",
    #29)	
    "Що таке система без післядії (у рамках теорії систем та системотехніки)?",
    #30)
    "Що таке простір станів (у рамках теорії систем та системотехніки)?",
    #31)	
    "Що таке фазова траєкторія (у рамках теорії систем та системотехніки)?",
    #32)	
    "Що складає суть системного підходу до проектування?",
    #33)	
    "Принципи системного підходу.",
    #34)	
    "Що таке ієрархічність (як принцип системного підходу)?",
    #35)	
    "Що таке структурність (як принцип системного підходу)?",
    #36)
    "Що таке взаємозалежність (як принцип системного підходу)?",
    #37)	
    "Що таке множинність опису (як принцип системного підходу)?",
    #38)	
    "Що таке цілісність (як принцип системного підходу)?",
    #39)	
    "Які є види забезпечення САПР?",
    #40)	
    "Що таке математичне забезпечення (як вид забезпечення САПР)?",
    #41)	
    "Що таке програмне забезпечення (як вид забезпечення САПР)?",
    #42)	
    "Що таке технічне забезпечення (як вид забезпечення САПР)?",
    #43)	
    "Що таке лінгвістичне забезпечення (як вид забезпечення САПР)?",
    #44)	
    "Що таке інформаційне забезпечення (як вид забезпечення САПР)?",
    #45)	
    "Що таке методичне забезпечення (як вид забезпечення САПР)?",
    #46)	
    "Що таке організаційне забезпечення (як вид забезпечення САПР)?"
    ];
task__3  = [
    "Що таке ESL(Electronic System-Level)?",
    "Що таке TLM(Transaction-Level Modeling)?",
    "Що таке ISS(Instruction Stream Simulator)?",
    "Для чого застосовуються Handel-C та SystemC?",
    "Що таке HLS(High-Level Synthesis)?",                    
    "Що таке PAL(Platform Abstraction Layer)?",
    "Що таке PSL(Platform Support Libraries)?"
    ];
task__4_5  = [
    "Назвіть чотири типи бібліотек в Altium Designer.",      
    "Яке призначення бібліотек моделей в Altium Designer?",
    "Яке призначення бібліотек символів в Altium Designer?",
    "Яке призначення інтегрованих бібліотек в Altium Designer?",    
    "Як виконати трасування диференційних пар в Altium Designer?"    
    ];
task__6  = [
    "Що декларує інтерфейс Servlet?", 
    "Що декларує інтерфейс ServletConfig?", 
    "Що декларує інтерфейс ServletRequest?",
    "Що декларує інтерфейс ServletResponse?",        
    "Що містить контекст сервлету?", 
    "Опишіть цикл роботи сервлету.",     
    "Що визначає абстрактний клас GenericServlet?", 
    "Яке призначення JSP?",     
    "Яке призначення JSTL?", 
    "Яке призначення тегу <c:out> ?", 
    "Яке призначення тегу <c:if> ?"
    ];
task__7a  = [
    'Написати клас сутності(entity bean) з JPA-анотаціями для роботи з заданою таблицею.\n(передбачається, що далі в коді проекту реалізацію JPA забезпечує Hibernate)\nТаблиця має містити такі поля:\n'  
    ];
task__7b  = [
    "Написати фрагмент jsp-файлу для відображення даних заданої таблиці.\nТаблиця має містити такі поля:\n"              
    ];
task__8  = [
    "Застосовуючи SystemC опишіть та реалізуйте SC_MODULE, що виконує задані обчислення за допомогою іншого SC_MODULE, що в свою чергу реалізовує додавання та віднімання(його також потрібно описати та реалізувати).\n"
    ];

task__8_r1  = [
    "X = 2*A", 
    "X = 4*A", 
    "X = 8*A",         
    "X = 16*A"          
    ];

task__8_r2  = [
    " + ", 
    " - "          
    ];

task__8_r3  = [
    "2*B", 
    "4*B", 
    "8*B",         
    "16*B"        
    ];

task__8_r4  = [
    " + ", 
    " - "           
    ];

task__8_r5  = [
    "2*C\n (A, B, C — знакові однобайтні значення)", 
    "4*C\n (A, B, C — знакові однобайтні значення)", 
    "8*C\n (A, B, C — знакові однобайтні значення)",         
    "16*C\n (A, B, C — знакові однобайтні значення)"        
    ];

# 1 * 4 * 3 * 2 * 3
task__7_r1  = [
    "ПІБ(один запис),\n"             
    ];
task__7_r2  = [
    "вік,\n", 
    "стаж в компанії,\n", 
    "рік народження,\n", 
    "загальний стаж,\n"             
    ];
task__7_r3  = [
    "назва поточного проекту,\n",
    "назва компанії замовника,\n",
    "назва технологічного стеку,\n"           
    ];
task__7_r4  = [
    "бюджет проекту,\n", 
    "кількість виділених годин на виконання проекту,\n"
    ];
task__7_r5  = [
    "рівень володіння англійською мовою(Elementary(Beginner), Pre-Intermediate, Intermediate, Upper-Intermediate, Advanced, Proficient).",
    "рівень посади(Junior, Middle, Senior, Lead).",
    "специфіка займаної посади(Front-end, Back-end, Full-Stack)."           
    ];

tasks = [task__1_2, task__3, task__4_5, task__6, task__7a, task__7b, task__8];

document = Document()
style = document.styles['Normal']
font = style.font
font.name = 'Time New Roman'
font.size = Pt(12) ## 11

def genPage(pageIndex):
    pageNumber = pageIndex + 1;  

    task12Index = pageIndex % 46;
    
    task3Index = pageIndex % 7;
    
    task45Index = pageIndex % 5;
    
    task6Index = pageIndex % 11;
      
    task7AIndex = pageIndex % 1;
    task7AEquationIndex = pageIndex % 1;   
    
    task7BIndex = pageIndex % 1;    
    task7BEquationIndex = pageIndex % 1;
    
    task7r5Index = pageIndex % 3;
    task7r4Index = (pageIndex - task7r5Index) // 3 % 2;
    task7r3Index = (pageIndex - 3 * task7r4Index - task7r5Index) // 6 % 3;
    task7r2Index = (pageIndex - 6 * task7r3Index - 3 * task7r4Index - task7r5Index) // 18 % 4;

    task8Index = pageIndex % 1;

    records = (
    ('ч.1', 1, task__1_2[task12Index], '5'),
    ('ч.1', 2, task__1_2[45 - task12Index], '5'),
    ('ч.1', 3, task__3[task3Index], '5'),
    ('ч.1', 4, task__4_5[task45Index], '5'),
    ('ч.1', 5, task__6[task6Index], '5'),
    ('ч.2', 6, task__7a[task7AIndex] + task__7_r1[0] + task__7_r2[task7r2Index] + task__7_r3[task7r3Index] + task__7_r4[task7r4Index] + task__7_r5[task7r5Index], '10'),
    ('ч.2', 7, task__7b[task7BIndex] + task__7_r1[0] + task__7_r2[task7r2Index] + task__7_r3[task7r3Index] + task__7_r4[task7r4Index] + task__7_r5[task7r5Index], '15'),      
    ('ч.2', 8, task__8[task8Index] + task__8_r1[pageIndex%4] + task__8_r2[(pageIndex>>2)%2] + task__8_r3[(pageIndex>>3)%4] + task__8_r4[(pageIndex>>5)%2] + task__8_r5[(pageIndex>>6)%4], '20'),
    ('', '', 'Всього балів', '70'),       # 'Σ70'
    )

    p = document.add_paragraph('')
    p.alignment = 1      
    p.add_run('Національний університет "Львівська політехніка"\n').bold = True
    p.add_run('Б І Л Е Т  № ' + '{:03d}'.format(pageNumber) + '\n').bold = True
    p.add_run('''до іспиту з дисципліни "Автоматизоване проектування комп'ютерних систем"
для студентів базового напряму "Комп'ютерна інженерія"''')

    table = document.add_table(rows=1, cols=4, style = 'Table Grid') #table.style = 'Table Grid'

    hdr_cells = table.rows[0].cells
    hdr_cells[1].text  = ''
    hdr_cells[1].text  = '''№ з/п'''
    hdr_cells[2].text  = ''
    hdr_cells[3].text  = '''К-сть балів'''
    for block, qn, task, desc in records:
        row_cells = table.add_row().cells
        row_cells[0].text = block
        row_cells[1].text = str(qn)
        row_cells[2].text = task
        row_cells[3].text = desc

    vEMU = 914400
    size0 = 0.5 * vEMU
    size1 = 0.2 * vEMU
    size2 = 5.0 * vEMU
    size3 = 0.2 * vEMU

    for index, element in enumerate(table.rows):
        table.cell(index,0).width = size0                                                
        table.cell(index,1).width = size1
        table.cell(index,2).width = size2
        table.cell(index,3).width = size3    

for index in range(64):
    print(index)
    if index !=0:
        document.add_page_break()
    genPage(index)

document.save('cad-exam-2023-2024.docx')
os.system("start cad-exam-2023-2024.docx")
